Repository: Ahmetlrd/Smart_Zoom_Project
Catalog: flutter_app/lib/l10n/app_*.arb
Languages: de, fr, tr

# login
source: Login with Zoom
de: Mit Zoom anmelden
fr: Se connecter avec Zoom
tr: Zoom ile giriş yap

# welcometext
source: WELCOME TO THE APPLICATION
de: WILLKOMMEN IN DER ANWENDUNG
fr: BIENVENUE DANS L'APPLICATION
tr: Uygulamaya Hoşgeldiniz

source: Language:
de: Sprache:
fr: Langue :
tr: Dil:

source: Notifications:
de: Benachrichtigungen:
tr: Bildirimler:

source: Meeting List
de: Besprechungsliste
fr: Liste des réunions
tr: Toplantı Listesi

source: Meeting Details
de: Besprechungsdetails
fr: Détails de la réunion
tr: Toplantı detayları

source: NLP Summary
de: NLP Zusammenfassung
fr: Résumé NLP
tr: NLP özeti

# saved
source: Saved Summaries
de: Gespeicherte Zusammenfassungen
fr: Résumés enregistrés
tr: Kayıtlı özetler

source: Logout
de: Abmelden
fr: Déconnexion
tr: Çıkış yap

source: Participants:
de: Teilnehmer:
tr: Katılımcılar:

source: Transcription
de: Transkription
tr: Transkript

# summary
source: Summary (AI)
de: Zusammenfassung (KI)
fr: Résumé (IA)
tr: Özet(AI)

source: Notes
de: Notizen
tr: Notlar

source: More info
de: Weitere Informationen:
fr: plus d'infos
tr: Daha fazla bilgi

source: Email
tr: E-posta

source: Account Type:
de: Kontotyp:
fr: Type de compte:
tr: Hesap türü:

source: Please login
de: Bitte einloggen
fr: Veuillez vous connecter
tr: Lütfen giriş yapınız

source: Close
de: Schließen
fr: Fermer
tr: Kapat

source: Delete
de: Löschen
fr: Supprimer
tr: Sil

source: Update
de: Aktualisieren
fr: Mettre à jour
tr: Güncelle

# save
source: Save and Finish
de: Speichern und Beenden
fr: enregistrer et Terminer
tr: Kaydet ve Bitir

# nosummaryyet
source: No meeting summary created yet.
de: Es wurde noch keine Zusammenfassung erstellt.
fr: Aucun résumé de réunion n'a encore été créé.
tr: Henüz bir toplantı özeti oluşturulmadı.

# firstnotification
source: app opened first time test notification
de: App zum ersten Mal geöffnet - Testbenachrichtigung
fr: l'application a été ouverte pour la première fois - notification de test
tr: uygulama ilk açıldı test bildirimi

# testnotification
source: Notification permission works!
de: Benachrichtigungsberechtigung funktioniert!
fr: L'autorisation de notification fonctionne !
tr: Bildirim izni çalışıyor!

# wannasave
source: Do you want to save?
de: Möchten Sie speichern?
fr: Voulez-vous enregistrer ?
tr: Kaydetmek istiyor musunuz?

# savetofirestore
source: You will save this summary to Firestore. Continue?
de: Diese Zusammenfassung wird gespeichert. Fortfahren?
fr: Ce résumé sera enregistré dans Firestore. Continuer ?
tr: Bu özeti Firestore'a kaydedeceksiniz. Devam edilsin mi?

# savedsuccesfully
source: Summary saved successfully.
de: Zusammenfassung erfolgreich gespeichert.
fr: Résumé enregistré avec succès.
tr: Özet başarıyla kaydedildi.

# writeprompt
source: Write your prompt to enhance the summary...
de: Schreiben Sie Ihre Anfrage zur Verbesserung der Zusammenfassung...
fr: Écrivez votre demande à ajouter au résumé...
tr: Özete eklenecek isteğinizi yazın...

# abouttodelete
source: You're about to delete the summary
de: Sie sind dabei, die Zusammenfassung zu löschen
fr: Vous êtes sur le point de supprimer le résumé
tr: Özeti silmek üzeresiniz

# areyousuretodelete
source: This action cannot be undone. Are you sure you want to delete the summary?
de: Diese Aktion kann nicht rückgängig gemacht werden. Sind Sie sicher, dass Sie löschen möchten?
fr: Cette action est irréversible. Êtes-vous sûr de vouloir supprimer ce résumé ?
tr: Bu işlem geri alınamaz. Özeti silmek istediğinize emin misiniz?

source: Cancel
de: Abbrechen
fr: Annuler
tr: Vazgeç

source: Summary deleted.
de: Zusammenfassung gelöscht.
fr: Résumé supprimé.
tr: Özet silindi.

# wannadeletemeeting
source: Do you want to delete the meeting?
de: Möchten Sie das Meeting löschen?
fr: Voulez-vous supprimer la réunion ?
tr: Toplantıyı silmek istiyor musunuz?

# areyousuretocont
source: This action cannot be undone. Do you want to continue?
de: Diese Aktion kann nicht rückgängig gemacht werden. Möchten Sie fortfahren?
fr: Cette action est irréversible. Voulez-vous continuer ?
tr: Bu işlem geri alınamaz. Devam edilsin mi?

source: Meeting deleted.
de: Meeting wurde gelöscht.
fr: Réunion supprimée.
tr: Toplantı silindi.

source: No summary found.
de: Keine Zusammenfassung gefunden.
fr: Aucun résumé trouvé.
tr: Özet bulunamadı.

source: No transcript found.
de: Kein Transkript gefunden.
fr: Aucune transcription trouvée.
tr: Transkript bulunamadı.

# nomeetingfound
source: No meeting record found.
de: Keine Meeting-Aufzeichnung gefunden.
fr: Aucun enregistrement de réunion trouvé.
tr: Hiç toplantı kaydı bulunamadı.

# joinedmeeting
source: You joined the meeting
de: Sie sind dem Meeting beigetreten
fr: Vous avez rejoint la réunion
tr: Toplantıya Katıldınız

# wannapsummarize
source: Start recording to get a summary.
de: Zum Mitschnitt starten, um eine Zusammenfassung zu erhalten.
fr: N’oubliez pas de lancer l’enregistrement pour recevoir un résumé à la fin de la réunion.
tr: Toplantı sonunda özet alabilmek için kaydı başlatmayı unutmayın.

# summaryready
source: Zoom summary is ready!
de: Zoom-Zusammenfassung ist bereit!
fr: Le résumé Zoom est prêt !
tr: Zoom özeti hazır!

# newmeetingsummarized
source: New meeting has been automatically summarized.
de: Neues Meeting wurde automatisch zusammengefasst.
fr: La nouvelle réunion a été résumée automatiquement.
tr: Yeni toplantı otomatik özetlendi.

source: Settings
de: Einstellungen
fr: Paramètres
tr: Ayarlar

# loginonzoom
source: Please log in with your Zoom account.
de: Bitte melden Sie sich mit Ihrem Zoom-Konto an.
fr: Veuillez vous connecter avec votre compte Zoom.
tr: Zoom hesabınız üzerinden giriş yapınız.

# needzoomfile
source: Zoom Folder Required
de: Zoom-Ordner erforderlich
fr: Dossier Zoom requis
tr: Zoom Klasörü Gerekli

# needzoomfileexp
source: Please select the Zoom folder. This folder should contain .m4a files.
de: Bitte wählen Sie den Zoom-Ordner aus. Dieser Ordner sollte .m4a-Dateien enthalten.
fr: Veuillez sélectionner le dossier Zoom. Ce dossier doit contenir des fichiers .m4a.
tr: Lütfen Zoom klasörünü seçin. Bu klasör içinde .m4a dosyaları olmalıdır.

# choosefile
source: Choose Folder
de: Ordner auswählen
fr: Choisir un dossier
tr: Klasör Seç

# couldnotlogin
source: Login failed.
de: Anmeldung fehlgeschlagen.
fr: Échec de la connexion.
tr: Giriş yapılmadı.

# searchformeeting
source: Search meeting title...
de: Meeting-Titel suchen...
fr: Rechercher un titre de réunion...
tr: Toplantı başlığı ara...

source: Delete meeting
de: Meeting löschen
fr: Supprimer la réunion
tr: Toplantıyı sil

# userinfo
source: User Information
de: Benutzerinformationen
fr: Informations utilisateur
tr: Kullanıcı Bilgisi

# areyousuretodeletemeeting
source: Are you sure you want to delete this meeting record?
de: Sind Sie sicher, dass Sie diesen Meeting-Datensatz löschen möchten?
fr: Êtes-vous sûr de vouloir supprimer cet enregistrement de réunion ?
tr: Bu toplantı kaydını silmek istediğinizden emin misiniz?

source: Select a meeting.
de: Wählen Sie ein Meeting aus.
fr: Sélectionnez une réunion.
tr: Bir toplantı seçin.

source: Generating...
de: Wird generiert...
fr: Génération...
tr: Oluşturuluyor...

# promptsecond
source: Using the following Zoom meeting transcripts, create a new, meaningful summary. There are multiple transcript segments from different audio files. Treat them as a single conversation. 1. Analyze the transcript and generate a clear and meaningful title, no more than 5 words. Return it only in this format: Title: Your Title Here (without quotes) 2. Below the title, write a professional, information-focused summary. This summary should include: - The meeting's purpose and main agenda - Who spoke (include names if available) - Topics, issues, and ideas discussed - Decisions made and conclusions - Action items (who, when, what) - Notable statements or highlights If some parts are short or missing, summarize only what's given. Do not invent or repeat information. PREVIOUS GPT SUMMARY: {summary} USER'S NEW REQUEST: "{userRequest}" TRANSCRIPT: {transcript}
de: Erstelle eine neue, aussagekräftige Zusammenfassung anhand der folgenden Zoom-Meeting-Transkripte. Es liegen mehrere Transkriptteile aus verschiedenen Audioaufnahmen vor. Betrachte sie als ein einziges Gespräch. 1. Analysiere das Transkript und erstelle einen klaren, aussagekräftigen Titel mit maximal 5 Wörtern. Gib den Titel nur in folgendem Format zurück: Title: Dein Titel hier (ohne Anführungszeichen) 2. Schreibe unter dem Titel eine professionelle, informationsorientierte Zusammenfassung, die folgende Punkte abdeckt: - Zweck und Hauptthema des Meetings - Wer gesprochen hat (Namen, falls verfügbar) - Diskutierte Themen, Probleme, Ideen - Getroffene Entscheidungen und Ergebnisse - To-dos (wer, wann, was) - Bemerkenswerte Aussagen oder Highlights Wenn Teile fehlen oder kurz sind, fasse nur das vorhandene Material zusammen. Keine Informationen erfinden oder wiederholen. VORHERIGE GPT-ZUSAMMENFASSUNG: {summary} NEUE ANFRAGE DES BENUTZERS: "{userRequest}" TRANSKRIPT: {transcript}
fr: Utilisez les transcriptions suivantes d'une réunion Zoom pour générer un nouveau résumé pertinent. Plusieurs segments de transcription proviennent de différents fichiers audio. Considérez-les comme une seule conversation. 1. Analysez la transcription et générez un titre clair et significatif, de 5 mots maximum. Retournez-le uniquement dans ce format : Title: Votre titre ici (sans guillemets) 2. Sous le titre, écrivez un résumé professionnel et centré sur l'information. Le résumé doit inclure : - L’objectif et l’ordre du jour principal - Les intervenants (précisez les noms si disponibles) - Les sujets, problèmes et idées abordés - Les décisions prises et conclusions - Les actions à entreprendre (qui, quand, quoi) - Les citations marquantes ou points importants Si certaines parties sont courtes ou manquantes, résumez uniquement les informations fournies. N’inventez rien et n’ajoutez pas de contenu inutile. RÉSUMÉ GPT PRÉCÉDENT : {summary} NOUVELLE DEMANDE DE L’UTILISATEUR : "{userRequest}" TRANSCRIPTION : {transcript}
tr: Aşağıdaki Zoom toplantısı transkriptlerinden yeni ve anlamlı bir özet oluştur. Toplantıya ait birden fazla ses kaydından alınmış transkript parçaları bulunmaktadır. Bunları bir bütün olarak değerlendir. 1. Transkripti analiz ederek en fazla 5 kelimeden oluşan, açık ve anlamlı bir başlık üret. Bu başlığı yalnızca şu formatta ver: Title: Başlık Buraya (tırnak kullanma) 2. Ardından, başlık satırının altına profesyonel ve bilgi odaklı bir özet yaz. Bu özet: - Toplantının amacı ve ana gündemini - Konuşan kişi veya kişileri (isim varsa belirt) - Tartışılan konular, sorunlar, fikirler - Alınan kararlar ve sonuçlar - Eylem maddeleri (kim, ne zaman, ne yapacak) - Öne çıkan ifadeleri veya önemli vurguları kapsamalıdır. Kısa veya eksik kısımlar varsa, yalnızca verilen içerik üzerinden en iyi özetlemeyi yap. Bilgi uydurma veya tekrar etme. ÖNCEKİ GPT ÖZETİ: {summary} KULLANICININ YENİ İSTEĞİ: "{userRequest}" TRANSKRİPT: {transcript}

# promptfirst
source: Your task has two parts: 1. **Generate a meeting title**: Analyze the transcript below and generate a concise, meaningful title of no more than 5 words. Return it in this exact format: Title: Your Title Here 2. **Generate a meeting summary**: The transcript below consists of segments from multiple audio recordings of a Zoom meeting. Each line or paragraph may represent a different part of the discussion. Your task is to combine these parts into a coherent and clear summary. The summary should allow the reader to understand the meeting's key content without having attended. Write in a professional, academic tone using clear, simple English. Your summary must address: - The meeting's purpose and main agenda - Speaker(s) involved (mention names if available) - Key points, discussions, issues, and ideas - Decisions made and conclusions reached - Action items (who will do what and when) - Noteworthy statements or highlights Some parts may be short or incomplete. Do not mention missing infoâ€”summarize only what's present. > Note: Although the transcript may be split into segments, treat them as one continuous meeting. TRANSCRIPT: {text}
de: Deine Aufgabe besteht aus zwei Teilen: 1. **Erzeuge einen Besprechungstitel**: Analysiere das untenstehende Transkript und generiere einen prägnanten, aussagekräftigen Titel mit maximal 5 Wörtern. Gib ihn in folgendem Format zurück: Title: Titel hier 2. **Erzeuge eine Zusammenfassung**: Das folgende Transkript besteht aus Segmenten mehrerer Audioaufnahmen eines Zoom-Meetings. Jeder Absatz kann einen anderen Gesprächsabschnitt darstellen. Kombiniere diese Inhalte zu einer zusammenhängenden und verständlichen Zusammenfassung. Die Zusammenfassung soll es dem Leser ermöglichen, die wichtigsten Inhalte des Treffens zu verstehen, auch ohne daran teilgenommen zu haben. Verwende einen professionellen, sachlichen Ton in klarem und einfachem Deutsch. Deine Zusammenfassung soll folgende Punkte enthalten: - Ziel und Hauptagenda der Besprechung - Beteiligte Sprecher (Namen angeben, falls vorhanden) - Besprochene Themen, Probleme, Ideen - Getroffene Entscheidungen und Ergebnisse - Maßnahmen (wer macht was bis wann) - Wichtige Aussagen oder Betonungen Einige Passagen können kurz oder unvollständig sein. Erwähne fehlende Informationen nicht, fasse nur das Gegebene zusammen. > Hinweis: Auch wenn das Transkript segmentiert ist, soll es als ein einziges Meeting behandelt werden. TRANSKRIPT: {text}
fr: Votre tâche comporte deux volets : 1. **Générer un titre de réunion** : Analysez la transcription ci-dessous et créez un titre concis et pertinent ne dépassant pas 5 mots. Retournez-le dans ce format exact : Title: Titre ici 2. **Générer un résumé de réunion** : La transcription ci-dessous provient de plusieurs enregistrements audio d'une réunion Zoom. Chaque paragraphe peut représenter une partie différente de la discussion. Assemblez ces parties en un résumé clair et cohérent. Ce résumé doit permettre au lecteur de comprendre les points clés de la réunion sans y avoir assisté. Adoptez un ton professionnel et académique, en français clair et simple. Le résumé doit inclure : - L’objectif et l’ordre du jour principal - Les intervenants (noms si disponibles) - Les sujets importants, problèmes ou idées abordés - Les décisions prises et les conclusions tirées - Les actions à entreprendre (qui, quoi, quand) - Les phrases marquantes ou points saillants Certains passages peuvent être incomplets. Ne mentionnez pas les absences d’informations ; concentrez-vous sur ce qui est fourni. > Remarque : Bien que la transcription soit segmentée, elle doit être traitée comme une seule réunion. TRANSCRIPTION : {text}
tr: Senin görevin iki bölümlü olacak: 1. **Toplantı başlığı** üret: Aşağıdaki transkripti analiz ederek en fazla 5 kelimeden oluşan, net ve anlamlı bir başlık oluştur. Bu başlığı yalnızca şu formatta döndür: Title: Başlık Buraya 2. **Toplantı özeti** üret: Aşağıda bir Zoom toplantısına ait birden fazla ses kaydından oluşturulmuş transkriptler bulunmaktadır. Her satır veya paragraf, farklı bir konuşma bölümünü temsil edebilir. Konular bazen dağınık gelebilir; bu yüzden parçaları anlamlı şekilde birleştirerek bütüncül ve anlaşılır bir özet oluşturman beklenmektedir. Kullanıcının bu özeti okuduğunda toplantıya hiç katılmamış olsa bile tüm önemli içerikleri anlayabilmesi gerekir. Özeti profesyonel ve akademik bir üslupla, sade ve açık bir Türkçe ile oluştur. Aşağıdaki başlıkları mutlaka değerlendir: - Toplantının amacı ve ana gündemi - Konuşan kişi(ler) kimdi? (isim varsa belirt) - Görüşülen önemli konular, sorunlar, fikirler - Alınan kararlar ve varılan sonuçlar - Eylem maddeleri (kim, ne zaman, ne yapacak) - Dikkat çeken ifadeler veya önemli vurgular Bazı parçalar eksik veya kısa olabilir. Ancak sen tüm parçaları bir araya getirerek en anlamlı yapıyı kurmaya çalış. Bilgi eksikse bunu belirtmeden sadece mevcut içerikten faydalan. > Not: Transkript parçalara bölünmüş olsa da tüm metinleri birleştirerek tek bir toplantının özeti olarak yaz. TRANSKRİPT: {text}
